Hi, I face the same issue when attempting to upgrade to v3, at first huge diff also with set order. 
After I have reordered all sets alphabetically, it still gives me this diff which gives me some concerns.

```
  # helm_release.flux2[0] will be updated in-place
  ~ resource "helm_release" "flux2" {
      ~ id                         = "flux2" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "2.6.3" -> (known after apply)
          ~ chart          = "flux2" -> (known after apply)
          ~ first_deployed = 1729852225 -> (known after apply)
          ~ last_deployed  = 1751987293 -> (known after apply)
          ~ name           = "flux2" -> (known after apply)
          ~ namespace      = "flux-system" -> (known after apply)
          + notes          = (known after apply)
          ~ revision       = 14 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "2.16.2" -> (known after apply)
        } -> (known after apply)
        name                       = "flux2"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }